In [5]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [17]:
df = pd.DataFrame({'Nome': ['Lucas', 'Barreto'],
                      'Idade': [28, 30]})

In [19]:
df[df['Idade'] >= 30]

      Nome  Idade
1  Barreto     30

In [22]:
df = df.rename(columns={'Idade': 'Anos de vida'})

In [25]:
df.columns = ['Nome dado', 'Idade']

In [52]:
df['email'] = ['LUCASbarRetO2025@OUTlook.COm', 'baRRETOlucas29@gMAIL.com']

In [55]:
df['email'] = pd.Series(df['email']).astype(str)

In [57]:
type(df['email'])

pandas.core.series.Series

In [59]:
df['email'] = df['email'].astype(str)

In [63]:
df = pd.DataFrame(df)

In [71]:
df.loc[len(df), "Nome dado"] = "Padre Quemedo"

In [74]:
novos = pd.DataFrame({
    'Nome dado': ['Cuscuzante', 'Debufante Forup']
})

In [79]:
df = pd.concat([df, novos], ignore_index=True)
df.drop(index=[3, 4])

                                               e-mail        Nome dado
0                        lucasbarreto2025@outlook.com              nan
1                            barretolucas29@gmail.com              nan
2   0    LUCASbarRetO2025@OUTlook.COm
1        baR...              nan
5                                                 NaN    Padre Quemedo
6                                                 NaN    Padre Quemedo
7                                                 NaN       Cuscuzante
8                                                 NaN  Debufante Forup
9                                                 NaN       Cuscuzante
10                                                NaN  Debufante Forup
11                                                NaN       Cuscuzante
12                                                NaN  Debufante Forup
13                                                NaN       Cuscuzante
14                                                NaN  Debufante Forup

In [84]:
type(df)

pandas.core.frame.DataFrame

In [96]:
df = df.dropna(subset=['e-mail'])

In [99]:
df.dropna()

                                              e-mail Nome dado
0                       lucasbarreto2025@outlook.com       nan
1                           barretolucas29@gmail.com       nan
2  0    LUCASbarRetO2025@OUTlook.COm
1        baR...       nan

In [104]:
df = df.drop(columns=['Nome dado'])

KeyError: "['Nome dado'] not found in axis"

In [116]:
df = df.drop_duplicates()
df.value_counts # Não tem ()
df.unique() # Só funciona em DataFrame, assim como o nunique (que exibe a quantidade de valores únicos)

AttributeError: 'DataFrame' object has no attribute 'unique'

In [121]:
df['Nome'] = ['Lucas', 'Gui', 'Socorro']

In [125]:
df['Salario'] = [5500, 7500, 4500]

In [127]:
df['Salario_Anual'] = df['Salario'] * 12

In [139]:
df = df.rename(columns={'e-mail': 'E-mail'})
df['E-mail'] = df['E-mail'].str.lower()

In [142]:
df['E-mail'] = df['E-mail'].fillna('socorrobarreto12@gmail.com')

In [143]:
df

                         E-mail     Nome  Salario  Salario_Anual
0  lucasbarreto2025@outlook.com    Lucas     5500          66000
1      barretolucas29@gmail.com      Gui     7500          90000
2    socorrobarreto12@gmail.com  Socorro     4500          54000